ci-app/app/Controllers/UserCrud.php

SELECT *
FROM `users`
ORDER BY `id` DESC
---
    public function index(){
        $userModel = new UserModel();
        $data['usersAll'] = $userModel->orderBy('id', 'DESC')->findAll();

INSERT INTO `users` (`name`, `email`) VALUES ('Rabbany', 'admin@gmail.com')
---
    public function store(){

        helper(['form']);
        $rules = [
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email'

        ];

        if($this->validate($rules)){

            $userModel = new UserModel();
            $data ['name'] = $this->request->getVar('name');
            $data ['email'] = $this->request->getVar('email');

            $userModel->insert($data);

SELECT *
FROM `users`
WHERE `users`.`id` = '10'
---
    public function edit($id){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->find($id);